Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བརྩོན་པའི་དགེ་སློང་མཐོང་ན། ཕྲག་དོག་དང་། སེར་སྣ་སྐྱེད་དེ་ བདག་ནི་སྔོན་ཆད་འདིར་ཤེས་ན་ ཕྱི་མ་འདི་ག་ལས་འོངས་པ་ཞིག །འདི་ནི་སྔོན་བདག་དང་འཐམས་པ་ཡིན་ན་ ཕྱི་མ་འདི་ག་ལས་འོངས་པ་ཞིག་ཅེས་ཟེར་ཞིང་གལ་ཏེ་དེའི་ཁྱིམ་བདག་དེ་དག་གིས་ལྷུང་བཟེད་དང་། ཆོས་གོས་དང་། བསོད་སྙོམས་དམ་བཅས་པར་གྱུར་པ་དང་། མལ་སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་ཁས་བླངས་པར་གྱུར་པ་རྣམས་སྔོན་ནི་བདག་དང་དམ་བཅས་པར་གྱུར་མོད་ཀྱི་ཕྱིས་འོངས་ནས་ སྦྱིན་པར་མི་འགྱུར་གྲང་སྙམ་ནས་ དེ་དེ་ལ་ཉེས་པ་གསུམ་སྐྱེད་དེ གསུམ་གང་ཞེ་ན། གནས་ལ་ཉེས་པ་སྐྱེད་དེ། གནས་དེ་ནས་ འགྲོའོ་སྙམ་སེམས་པ་དང་། ཤེས་པར་བྱ་བ་མ་ཡིན་པ་ཤེས་ཤིང་། ཤེས་པར་བྱ་བ་མི་ཤེས་ལ། གང་ཅུང་ཟད་སྟེན་པ་ཡང་མི་བརྟེན་པ་དང་། དེ་ཁྱིམ་པ་ལ་ཉེས་པ་བསྐྱེད་པ་སྟེ། དེ་དགེ་སློང་དེ་གནས་གསུམ་རྗོད་པར་བྱེད་དོ། ། གསུམ་གང་ཞེ་ན། གནས་ཀྱི་ཉེས་པ་བརྗོད་པ་དང་། ཉམས་མི་དགའ་བ་རྗོད་ཅིང་ཁྱིམ་གཏོང་བར་བྱེད་པ་དང་། མི་བདེན་པའི་གཏམ་ཟེར་ཞིང་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པ་འདི་དག་གཡོ་བྱེད་དོ་ཞེས་ཡིད་རྟོན་པའི་སྦྱོར་བས་དམ་བཅའ་བར་བྱ་བའི་ཆོས་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་ཁྱིམ་ལ་སེར་སྣ་བྱེད་པ་ཆོས་དཀར་པོ་ཡོངས་སུ་ཉམས་པར་འགྱུར་བའོ། །
en: “Śāriputra, a mendicant who has this kind of attitude will become envious and miserly, thinking, ‘I have been promised things before. How can I continue to receive them? I have been guaranteed things before. How can I continue to receive them?’ If householders promise him bowls, clothing, and food, bedding, medicine, and utensils, and he thinks, ‘Well, they promised me certain things, and now when I come to collect them they do not give them to me,’ he makes three mistakes. What are these three mistakes? He sees the place as bad, and thinks, ‘I will leave this place.’ He knows what is not worth knowing. He does not know what should be known. Whatever he concerns himself with, he cannot be trusted, and he develops bad habits in his relations with householders. The mendicant talks about three things. What three things does he talk about? He talks about the faults of the dwelling. He expresses his dissatisfaction and dismisses the house. He makes false excuses, saying, ‘They are deceitful, these wicked men,’ and he teaches the Dharma believing his own statements. This, Śāriputra, is how miserliness in one’s relations with families leads to good qualities becoming corrupted.

source: ཤཱ་རིའི་བུ་ཁྱིམ་ལ་སེར་སྣ་བྱེད་པ་ལ་གནས་པ་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པ་དེ་དག་གིས་སྡོམ་པ་དང་། སྡོམ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བཏང་བར་འགྱུར་ཏེ། སྡོམ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་སློབ་པར་མི་འགྱུར་རོ།། །།
en: “In addition, Śāriputra, wicked men who are miserly in their relations with families abandon their vows; they do not keep to the vows of a bodhisatva. They do not follow the training in the vows of a bodhisatva and in keeping to the vows of a bodhisatva. These, Śāriputra, are points that should be taken to heart.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། ཡངས་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ རིག་པ་དང་། ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ལོ་བྱེ་བ་ཕྲག་དགུ་བཅུའི་བར་དུ་བཞུགས་སོ། ། དེའི་ཉན་ཐོས་ཀྱང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུའི་ཉན་ཐོས་རྣམས་ཀྱི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་བྱུང་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས་སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་གི་བར་དུའོ། །
en: “Once in the past, Śāriputra, an uncountably many, vast, innumerable, inconceivable eons ago, a tathāgata, arhat, fully accomplished buddha by the name of Abhyudgata appeared in the world. He was perfect in wisdom and conduct, he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. He remained for nine hundred million years, and he had a great following of ninety million trillion śrāvakas. They were all arhats who had eliminated the defilements, who were free from vices, who were powerful, and so forth, and who had reached the very highest level of complete mastery of the mind.

source: ཡང་དེའི་ཚེ་ཁྱིམ་བདག་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་ཆེ་བ། ལོངས་སྤྱོད་ཆེ་ཞིང་ལོངས་སྤྱོད་མང་བ། བདག་དབང་བ་མང་བ། ནོར་དང་ཡོ་བྱད་མང་པོ་དང་ལྡན་ཞིང་འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻདཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་མང་པོ་དང་ལྡན་པ། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་མང་ཞིང་གླང་པོ་ཆེ་དང་། རྟ་དང་། ར་ལུག་མང་བ། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་མང་པོ་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ དེའི་ཁྱེའུ་དེ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་ སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པའི་མཆོག་དང་ལྡན་པ་སྡོམ་པ་ཞེས་བྱ་བ་དང་། སྡོམ་པ་ལ་གནས་པ་ཞེས་བྱ་བ་གཉིས་བྱུང་སྟེ དེ་གཉིས་དུས་གཞན་ཞིག་ན་ཁང་ཏོག་ཏུ་དོང་བར་གྱུར་ཏོ། །
en: “At that time there was a householder by the name of Suvicaya. He was wealthy and prosperous, with great riches and many possessions, a great deal of property, many possessions and tools, an abundance of precious metal, gold, jewels, pearls, gems, shells, crystals, and coral, many male and female slaves, workers, and laborers, large stocks of elephants, horses, goats, cattle, and sheep, and storerooms filled with great wealth and stocks of grain. He had two sons who were handsome, beautiful, pleasant to behold, and endowed with an abundance of the most supreme features. Their names were Samvara and Samvarasthita.

source: ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་པ་དེ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཆོས་གོས་དང་ཤམ་ཐབས་མནབས། ལྷུང་བཟེད་བསྣམས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་བསྐོར་ཅིང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་བསོད་སྙོམས་ཀྱི་ཕྱིར་གྲོང་ཁྱེར་དེར་གཤེགས་པ་དང་། མཛེས་པ་དགའ་བར་འགྱུར་བ། དབང་པོ་ཞི་བ། ཡིད་ཞི་བ། །མཆོག་ཏུ་དུལ་བ་དང་། ཞི་གནས་ཀྱི་མཆོག་ཐོབ་པ། ཤིན་ཏུ་དུལ་ཞིང་ཞི་གནས་ཐོབ་པ། དབང་པོ་དུལ་ཅིང་སྦས་པ་གླང་པོ་ལྟར་རབ་ཏུ་དུལ་བ། མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་གསལ་བ། གསེར་གྱི་མཆོད་སྡོང་ལྟ་བུ། ས་ལེ་སྦྲམ་གྱི་རི་ལྟ་བུ། རིན་པོ་ཆེས་ཡོངས་སུ་གང་བའི་མཚོ་ལྟ་བུ། ལྷས་ཀུན་ནས་བསྐོར་བའི་བརྒྱ་བྱིན་ལྟ་བུ། ཡིད་རབ་ཏུ་ཞི་བའི་ཚངས་པ་ལྟ་བུའི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་མཛེས་ཤིང་དགའ་བར་འགྱུར་བ་དེ་རྒྱང་མ་ནས་བྱོན་པ་ཁྱེའུ་དེ་གཉིས་ཀྱིས་མཐོང་ངོ་། །
en: “Once, Śāriputra, they were on the roof of the mansion when the Lord Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha, was on his morning visit to the town to collect alms, carrying his bowl and robes, and accompanied by the community of mendicants, at the head of the community of mendicants. He was graceful and elegant, with his senses composed and his mind at ease, supremely disciplined and tranquil, having attained the supreme form of discipline and meditative tranquility. His senses subdued, with the dignity of an elephant, he was clear and shining like a lake of still water. He was like a pillar made of gold, like a golden mountain, like an ocean filled with jewels, like Śakra flanked by his retinue of gods, like Brahmā with his tranquil mind. The two sons saw the Lord Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha, approaching from afar in this graceful and pleasant manner.

source: ཤཱ་རིའི་བུ་དེ་ན་གང་སྡོམ་པ་ལ་གནས་པ་ཞེས་བྱ་བའི་གཞོན་ནུ་དེས་དང་པོ་ཉིད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་སྔར་མཐོང་ནས་དེས་ནུ་བོ་དེ་ལ་སྨྲས་པ། སེམས་ཅན་གྱི་རྒྱལ་པོ་འདི་ལྟ་བུ་མཛེས་པ་ནུ་བོ་ཁྱོད་ཀྱིས་སྔོན་ནམ་ཡང་རེས་འགའ་མཐོང་ངམ།
en: “Śāriputra, the boy named Samvarasthita was the first to spot the Lord Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha, and he said to his brother, ‘Hey, brother, have you ever seen anyone as elegant as the Lord of Beings?’

source: དེས་ཕུ་བོ་ལ་ཕུ་བོ་སེམས་ཅན་གྱི་རྒྱལ་པོ་མཛེས་པ་འདི་ལྟ་བུ་བདག་གིས་སྔོན་ལན་འགའ་ཡང་མ་མཐོང་ངོ་ཞེས་དེ་སྐད་སྨྲས་པ་དང་།
en: “He answered his brother, ‘No, brother, I have never before seen anyone quite as elegant as the Lord of Beings.’

source: དེས་ནུ་བོ་ང་ནི་འདི་དང་འདྲ་བ་ཉིད་དུ་འགྱུར་བར་བྱའོ་ཞེས་དེ་སྐད་སྨྲས་སོ། །
en: “He then said, ‘Brother, I want to be like him.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པས་ཁྱེའུ་སྡོམ་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, Samvarasthita spoke in verse to Samvara:

source: སྡོམ་པ་ཇི་ལྟར་མཐོང་བ་བཞིན། །དེ་འདྲ་བར་ནི་བདག་བསྒྱུར་ཏེ། །
en: “ ‘I will become like him, Just as disciplined as the one we have seen,

source: བདག་ནི་དེ་བས་མང་བ་ཡི། །དགེ་སློང་དགེ་འདུན་བསྡུ་བར་བྱ། །
en: And I will lead an even larger Community of mendicants than him.

source: བྱང་ཆུབ་ཀྱི་ནི་ལམ་གྱི་ཕྱིར། ཟས་དང་སྐོམ་ནི་མི་བཟའོ། །
en: “ ‘For the sake of the path to awakening, We will abstain from enjoying food and drink.

source: སྡོམ་པ་འདི་ནི་རྒྱལ་བ་སྟེ། །
en: Emulating the discipline of the Victorious One,

source: བདག་ནི་ཁྱིམ་འདིར་དགའ་བ་མེད། །
en: I will not participate in the pleasures of the home.

source: སེམས་ཅན་ཀུན་གྱི་མཆོག་འདི་ནི། །སྐར་མང་དབུས་ན་ཟླ་བ་བཞིན། །མཐོང་ནས་དད་པར་སུ་མི་འགྱུར། །
en: “ ‘When they see him, supreme among sentient beings, Like the moon among all the stars, Who can help but develop faith?

source: ཁྱིམ་ནས་མི་འབྱུང་སུ་ཞིག་ཡོད། །
en: Who would not leave his home behind?’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པས་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པ་ལ་སླར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, Samvara spoke in verse to Samvarasthita:

source: ཚིག་ཏུ་བྱས་པས་མི་འགྱུར་གྱིས། །སྒྲ་བོ་ཆེ་ནི་མ་འབྱིན་ཅིག །
en: “ ‘You will not achieve this simply by talking about it. Do not let yourself be carried away by lofty words.

source: ང་ནི་ཚིག་ཏུ་མི་སྨྲ་སྟེ། །
en: I will not say it out loud—

source: འཚང་རྒྱ་གང་མྱུར་ཤེས་པར་བྱ། །
en: It will be clear soon enough who will attain awakening quickly.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པས་ཁྱེའུ་སྡོམ་པ་ལ་སླར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, Samvarasthita spoke these verses to Samvara:

source: བདག་ཉིད་སེར་སྣ་སེམས་པ་དང་། །ཞུམ་པ་དག་གི་ལམ་མིན་ཏེ། །
en: “ ‘Dejection and miserliness Are not part of my path.

source: མི་མཆོག་སངས་རྒྱས་འགྱུར་རོ་ཞེས། །བཟང་པོའི་སྒྲ་ནི་བདག་གིས་བསྒྲག །
en: I will speak words of goodness. I will become a buddha, supreme among men.

source: བདག་ནོར་ཤེས་པར་མི་འགྱུར་བ། །སེར་སྣ་ཅན་གྱི་རྟགས་ཡིན་ནོ། །
en: “ ‘I shall not think of these symbols Of miserliness as property.

source: བདག་ནི་མི་སྨྲ་མི་བྱ་སྟེ། །
en: I cannot remain silent about this.

source: བདག་གཏོང་ནོར་ལྟ་ག་ལ་ཞིག །
en: When one has given up the self, how can there be property?

source: ཁྱིམ་འདི་དག་ནི་ཁྱོད་ཀྱིའོ། །ང་ནི་བྱང་ཆུབ་ལམ་ཕྱིར་འགྲོ། །
en: “ ‘I leave this house to you. I am setting out on the path to awakening.

source: ཁྱིམ་དང་ནོར་ནི་ཁྱོད་ཀྱི་སྟེ། །
en: This house and these riches are yours—

source: བདག་ནི་སངས་རྒྱས་དགའ་བའོ། །
en: I will find my joys in awakening.

source: སུམ་ཅུ་རྩ་གཉིས་མཆོག་གི་མཚན། ། འདི་འདྲ་བདག་མཐོང་གྱུར་ན། །ལྟ་བ་ཉམས་པ་མ་གཏོགས་པར། །བྱང་ཆུབ་མཆོག་ནི་སུ་མི་ཚོལ། །
en: “ ‘Who can possibly do anything Other than going to seek the highest awakening When one has seen the one with the thirty-two characteristics? Only those whose vision is inferior.

source: ཁྱིམ་དག་དང་ནི་ནོར་རྣམས་དང་། །ཕ་དང་མ་དང་གཉེན་རྣམས་དང་། །བདག་གིས་དེ་དག་ཀུན་སྤངས་ཏེ། །སངས་རྒྱས་དྲུང་དུ་འགྲོ་བར་བྱ། །
en: “ ‘House and riches, Parents and relatives— I leave them all behind And set out toward awakening.

source: འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པའི། །འཇིག་རྟེན་སྣང་མཛད་རབ་ཏུ་དཀོན། །བསྐལ་པ་བྱེ་བ་སྟོང་དུ་ཡང་། །དེ་ནི་ཐོས་པར་ཤིན་ཏུ་དཀོན། །
en: “ ‘It is rare to encounter the light of the world, The protector of the world, the illuminator. Even over the course of a billion eons, It is immensely difficult just to hear him speak.

source: ནམ་མཁའ་དག་པའི་ཟླ་བ་ནི། །ས་ལ་ལམ་མེར་འདུག་པ་ལྟར། །རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཞུགས་ནས དགེ་སློང་དགེ་འདུན་མདུན་དུ་བྱས། །
en: “ ‘He is so beautiful, it is as if the moon Had descended to the earth And entered the royal palace Accompanied by the community of mendicants.

source: འོད་ཟེར་སྟོང་པའི་ཉི་མ་ནི། །བར་སྣང་གནས་ན་ལྷང་ངེ་བ། །དེ་བཞིན་སངས་རྒྱས་སྲས་དབུས་ན། །ཀུན་ནས་རབ་ཏུ་མཛེས་པར་སྣང་། །
en: “ ‘When the Buddha appears upon the road, He shines as brilliantly As the thousandfold rays of the sun Radiating throughout space.

source: རི་ཡི་རྒྱལ་པོ་རི་རབ་ནི། །རིན་ཆེན་བདག་ཉིད་མཛེས་པར་སྣང་། ། དེ་བཞིན་སངས་རྒྱས་མཛེས་པ་ཡང་། །དགེ་སློང་དགེ་འདུན་མདུན་དུ་བྱས། །
en: “ ‘Accompanied by his community of mendicants, The Buddha shines Like Sumeru, the king of mountains, Shines as if made of jewels.

source: སྐུ་ཡི་གཟི་བརྗིད་འབར་བ་ནི། །འགྲོ་བ་འདི་དག་རྣམས་ལ་སྣང་། །གཟི་བརྗིད་ཕུང་པོའི་གཟུགས་ཅན་ཏེ། །རྐང་གཉིས་དམ་པ་དེ་མཛེས་སོ། །
en: “ ‘A body blazing like fire That lights up the world, A manifestation of fire—The supreme among men shines like this.

source: ལྷ་དང་ཀླུ་དང་མི་རྣམས་ནི། །རྫུ་འཕྲུལ་དག་གིས་རབ་སྡུད་ཅིང་། །རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཞུགས་ནས། །ཆོ་འཕྲུལ་དག་ནི་རྣམ་པར་སྟོན། །
en: “ ‘Outclassing gods, nāgas, and men, With his prowess in magical abilities His mastery becomes apparent When he enters the royal palace.

source: སུམ་ཅུ་རྩ་གཉིས་བསོད་ནམས་དམ་མཆོག་མཚན། །ཆོས་ཀྱི་བདག་པོ་འདི་འདྲ་མཐོང་ནས་ནི། །བྱིས་པ་མ་བསླབས་པ་དག་མ་གཏོགས་པར། །ཐེག་པ་དམན་ལ་སུ་ཞིག་འཇུག་པར་འགྱུར། །
en: “ ‘Who can continue following lesser vehicles When they see this lord of the Dharma With the thirty-two supreme characteristics of excellent merit? No one but unlearned immature people.

source: ཤིན་ཏུ་དཀོན་པ་རབ་ཏུ་མཛེས་བྱུང་བ། །མི་མཆོག་འདི་ནི་བདག་གིས་མཐོང་བས་ན། །བྱང་ཆུབ་ཕྱིར་ནི་མངོན་པར་ཞུགས་གྱུར་ནས། ། བདེ་བར་གཤེགས་པའི་དྲུང་དུ་ཉེ་བར་འགྲོ། །
en: “ ‘Having seen the one who is supreme among men, Excellent and so incredibly difficult to encounter, I will go and meet the Sugata So that I can set out toward awakening.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པས་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, Samvara spoke in verse to Samvarasthita:

source: བདག་ནི་ལེ་ལོའི་ལམ་དག་ནས། །
en: “ ‘If I remain on the path of laziness,

source: སངས་རྒྱས་དྲུང་དུ་མི་འགྲོ་སྟེ། །
en: I will not get to meet the Buddha.

source: ཁང་ཏོག་འདི་ནས་ཕྱི་རོལ་དུ། །བདག་གིས་ལུས་ནི་མཆོང་བར་བྱ། །
en: We should leave the palace So that we can honor him in person.

source: བདག་ཏུ་འདུ་ཤེས་བསལ་གྱུར་ནས། །
en: “ ‘Abandoning any idea of self,

source: སྲོག་ལ་བལྟ་བར་མི་བྱ་སྟེ། །
en: And with no concern for this life,

source: ཡེ་ཤེས་མཆོག་ནི་ཡོངས་བཅོལ་ཞིང་། །སངས་རྒྱས་དྲུང་དུ་འགྲོ་བར་བྱ། །
en: I will go and meet the Buddha, And seek out the highest knowledge.

source: ཕ་ལ་ཆགས་དང་མ་ལ་ཆགས། །
en: “ ‘To long for one’s mother, to long for one’s father,

source: ཁྱིམ་ལ་ཆགས་པ་མི་བཟད་པ། །དེ་དག་ཐམས་ཅད་རྣམ་སྤངས་ནས། །
en: And to long for one’s home is very hard. I will give up all these things.

source: སངས་རྒྱས་དྲུང་དུ་འགྲོ་བར་བྱ། །
en: I will go and meet the Buddha.

source: འདི་འདྲར་འགྱུར་བར་གང་འདོད་པ། །དེ་ནི་སངས་རྒྱས་དགའ་བ་ཡིན། །
en: “ ‘This kind of aspiration Is what pleases the Buddha.

source: རིན་པོ་ཆེ་ནི་ཀུན་སྤངས་ནས། །
en: I will therefore give up all riches,

source: དེ་ལྟར་ཤཱ་རིའི་བུ་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པ་ནི་ཁྱིམ་གྱི་སྐས་ལས་བབས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་ག་ལ་བ་དེར་སོང་ངོ་། ། ཡང་ཤཱ་རིའི་བུ་ཁྱེའུ་སྡོམ་པ་ནི་ཁང་ཏོག་དེ་ནས་མཆོངས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་འཕགས་ག་ལ་བ་དེར་ཤིན་ཏུ་མྱུར་དུ་སོང་ངོ་། ། ཁྱེའུ་སྡོམ་པ་ལ་གནས་པ་ནི་ཕྱི་ནས་སོང་ངོ་། ། ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པས་བཅོམ་ལྡན་འདས་དེ་ལ་ན་བཟའ་སྲང་བྱེ་བ་རི་བ་ཕུལ་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: “So it was, Śāriputra, that Samvarasthita descended the stairs to go and meet the Lord Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha. But, Śāriputra, Samvara jumped down from the roof of the mansion and reached the Lord, the Tathāgata Abhyudgata, first, before Samvarasthita got there. Then, Śāriputra, Samvarasthita offered the Lord a cloth that was worth ten million, and he spoke these verses:

source: བདག་ནི་གཟུགས་རྣམས་ཚོལ་བའི་ཕྱིར། །སངས་རྒྱས་ན་བཟའ་འབུལ་མ་ལགས། །མི་མཆོག་དག་ནི་ཅི་འདྲ་བ། །དེ་འདྲ་བར་ནི་འགྱུར་བར་བགྱི། །
en: “ ‘I am not giving the Buddha this cloth In order to look good, But in order to become Just like the supreme man.

source: ཡེ་ཤེས་ཕུང་པོ་ལྡན་པ་དང་། །བརྩོན་འགྲུས་སྟོབས་ལ་རབ་གནས་ཤིང་། །སུམ་ཅུ་རྩ་གཉིས་མཚན་མངའ་བ། །རྐང་གཉིས་དམ་པར་གྱུར་པར་ཤོག །
en: “ ‘May I become like the supreme among those who walk on two feet, Mastering the totality of knowledge, Standing firm through the strength of my vigor, And in possession of the thirty-two characteristics.

source: སྟོབས་བཅུ་རྣམས་དང་ལྡན་གྱུར་ཅིང་། །མི་འཇིགས་པ་ལ་རབ་གནས་པ། །དེ་བཞིན་གཤེགས་པ་ཅི་འདྲ་བར། །དེ་འདྲ་བར་ནི་འགྱུར་བར་ཤོག །
en: “ ‘Furnished with the ten powers, With stable confidence, May I become just like him, Like the Tathāgata.

source: ཁྱོད་ཀྱིས་ཆོས་གང་མཁྱེན་པ་དང་། །གང་ལ་བཞུགས་པར་ལྷང་ངེ་བར། །བྱང་ཆུབ་དམ་པ་སངས་རྒྱས་ནས། །
en: “ ‘The Dharma that you have discovered Lights up any place it is found. When I have reached supreme awakening,

source: བདག་ནི་ཆོས་དེ་སྟོན་པར་ཤོག །
en: I will teach that Dharma.

source: བདག་ནི་གཟུགས་རྣམས་མངོན་པར་ཚོལ་བའི་ཕྱིར། །སངས་རྒྱས་ན་བཟའ་མཆོག་འབུལ་མ་ལགས། །ལྷར་བཅས་འཇིག་རྟེན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་མཆོག་གི་ཞི་བ་མངོན་པར་ཚོལ། །
en: “ ‘I do not offer this excellent cloth to the Buddha Because I want to look good. I want to attain the peace of supreme awakening So that I may benefit the world with its gods.

source: གཉིས་སུ་མེད་པའི་ཆོས་མཆོག་དེར་གནས་ཤིང་། །ཕ་རོལ་རྒོལ་བ་ཀུན་གྱིས་མི་གཡོས་པ། །ཆོས་དེ་ཉིད་ནི་མངོན་པར་འཚལ་བའི་ཕྱིར། །སངས་རྒྱས་ལ་ནི་ན་བཟའ་མཆོག་འབུལ་ལོ། །
en: “ ‘When one dwells in the supreme nondual Dharma, One cannot be toppled by any opponent. With this Dharma as my goal, I offer the Buddha excellent supreme cloth.

source: ལྷར་བཅས་འཇིག་རྟེན་དག་ལ་སྨན་པའི་ཕྱིར། །གང་ན་སྐྱེ་རྒ་ན་འཆི་མ་མཆིས་ཤིང་། །མྱ་ངན་དང་ནི་སྨྲེ་སྔགས་མ་མཆིས་པ། །ཞི་བའི་ཆོས་དེ་བདག་ནི་སྟོན་པར་ཤོག །
en: “ ‘That which is not born, does not grow old, Does not get sick, and does not experience pain or sorrow— That is the Dharma of peace that I will teach For the benefit of the world with its gods.

source: གང་ན་འདོད་ཆགས་ཞེ་སྡང་མ་མཆིས་ཤིང་། །གཏི་མུག་མ་མཆིས་སྲེད་པ་མ་མཆིས་པ། །བསིལ་དངོས་བདུད་རྩི་འདུས་མ་བགྱིས་པ་དེ། །
en: “ ‘That which is free from attachment, anger, Confusion, and desire; Cool, immortal, and uncompounded—

source: བདག་ནི་བྱང་ཆུབ་སངས་རྒྱས་སྟོན་པར་ཤོག །
en: That is what I will teach when I have attained awakening.

source: གང་ལ་ཁྱོད་བཞུགས་སེམས་ཅན་ལྷ་ཀླུ་དང་། །དེ་བཞིན་མི་དང་སེམས་མེད་དངོས་པོ་དང་། །དེ་ལྟར་སེམས་དང་ལྡན་པ་རབ་འདུད་པ། །བདག་ནི་ཞི་བའི་ཆོས་དེ་སྟོན་པར་ཤོག །
en: “ ‘Wherever you remain you are honored by sentient beings, By gods, nāgas, and men, By the insentient as well as the sentient, I will teach the Dharma of peace.

source: གར་གནས་སངས་རྒྱས་ཞིང་དུ་སྣང་བ་དང་། །ཕྱོགས་བཞི་དག་ན་ཀུན་དུ་སྣང་བ་དང་། །མུན་པ་ཆེན་པོར་འོད་ཟེར་ཕུང་ལྟ་བུའི། །བསིལ་དངོས་བདུད་རྩི་དེ་ལ་རེག་པར་ཤོག །
en: “ ‘Wherever you shine forth in buddha fields, Manifesting throughout the four directions of space, Like a mass of light within great darkness, I will spread the cooling nectar.

source: འདོད་པའི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས་དག་དང་། །དེ་བཞིན་གཟུགས་མེད་ཁམས་ལ་རྟག་མི་གནས། །དགའ་དང་མི་དགའ་ཐམས་ཅད་རབ་དབེན་པའི། །ཆོས་ཀྱི་དམ་པ་དེ་ནི་བདག་སྟོན་ཤོག །
en: “ ‘That which is never part of the realm of desire, Or the formless realm or the realm of form, That which is beyond any kind of likes or dislikes— This is the noble Dharma that I shall teach.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་སྡོམ་པ་ལ་གནས་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས་པ་དེ་ལ་ཤིང་ལྷམ་སར་པ་ཟུང་ཅིག་ཕུལ་ལོ། ། ཕུལ་ནས་ཀྱང་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: “Then, Śāriputra, Samvara gave the Lord Abhyudgata, the tathāgata, the arhat, the fully accomplished Buddha, a pair of new shoes, and when he had made his offering, he spoke these verses:

source: སེམས་ཅན་རྣམས་ཀྱི་གནས་རྟེན་དང་། །དཔུང་གཉན་མགོན་དུ་གྱུར་པར་ཤོག །
en: “ ‘May I become a protector of beings, A shelter, support, and final refuge.

source: ངན་པའི་ལམ་དུ་མི་མཆི་ཞིང་། །རྟག་ཏུ་ལམ་རྣམས་སྟོན་པར་ཤོག །
en: May I not take the wrong roads But always keep teaching the path.

source: བྱིས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་འདི། །འདོད་པ་ནམ་ཡང་སྟེན་མ་གྱུར།
en: “ ‘May I never be led astray by desire Or conduct myself in an immature way.

source: འདུས་བྱས་དག་ཀྱང་རྣམ་སྤངས་ནས། །
en: May I abandon conditioned things

source: རྟག་ཏུ་སངས་རྒྱས་འབྱུང་རྙེད་གྱུར། །
en: And always encounter buddhas.

source: འཇིག་རྟེན་སྣང་མཛད་མཐོང་ནས་ཀྱང་། །རྐང་གཉིས་དམ་པ་མཆོད་པར་གྱུར། ། སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་དམ་པ་ཡོངས་སུ་བཅོལ། །
en: “ ‘Having seen the light of the world, May I worship the supreme among those who walk on two feet And go in search of supreme awakening For the benefit of all who live.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །མེ་ཏོག་ཕྲེང་བ་སྤོས་རྣམས་དང་། །རྒྱལ་མཚན་དག་དང་གདུགས་རྣམས་ཀྱིས། །གླང་པོ་ཆེན་པོ་བཀུར་སྟི་བགྱི། །
en: “ ‘May I honor the great elephant With garlands of flowers, incense, Banners, and parasols For the benefit of all who live.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཆོས་གོས་དག་དང་བསོད་སྙོམས་དང་། །མལ་སྟན་རྣམས་དང་གདིང་བ་ཡིས། །སངས་རྒྱས་རྣམས་ལ་མཆོད་པར་བགྱི། །
en: “ ‘May I offer worship to the buddhas With clothing, offerings of food, And beds and blankets For the benefit of all who live.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །རྔ་དང་དུང་དང་རྔ་ཆེན་དང་། །སིལ་སྙན་དག་དང་ཝང་གིས། །འཇིག་རྟེན་སྣང་མཛད་མཆོད་པར་ཤོག །
en: “ ‘May I worship the light of the world With the sounds of drums and conches And with melodious lutes For the benefit of all who live.

source: བཟའ་བ་དང་ནི་བཅའ་བ་དང་། །དུས་ཀྱིས་མ་ཕྱེ་བཟའ་བ་རྣམས། །དེ་དག་གིས་ནི་འཇིག་རྟེན་མགོན། །སྐྱོབ་པ་བདག་གིས་མཆོད་པ་བགྱི། །
en: “ ‘May I offer food and drink As worship to the protectors of the world, The refuges— Nourishment to be enjoyed at the appropriate time.

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །མཆོད་པ་རྒྱ་ཆེན་བགྱིས་གྱུར་ནས། །དེ་ཉིད་དུ་ནི་རབ་བྱུང་སྟེ། །ཚངས་པར་སྤྱོད་པ་བདག་གིས་སྤྱད། །
en: “ ‘When I have performed this vast act of worship For the benefit of all who live, I will become a renunciant And live the life of purity.

source: སྲོག་ཆགས་ཀུན་གྱི་མགོན་དུ་བདག་གྱུར་ཅིག །བདག་ནི་ལམ་གོལ་ནམ་ཡང་འགྲོ་མ་གྱུར། །
en: “ ‘May I become a protector for all who live And never again take the wrong paths.

source: ཡན་ལག་བརྒྱད་ལྡན་ལམ་མཆོག་རབ་གནས་ནས། །བདག་གིས་སྲོག་ཆགས་བྱེ་བ་དེ་ཉིད་དགྲོལ། །
en: I will follow the supreme eightfold path And give this same opportunity to millions of beings.

source: དམན་ལ་འཕགས་མིན་མཆོག་ཏུ་སྨད་པ་ཡི། །འདོད་ལ་བདག་ནི་ནམ་ཡང་སྟེན་མ་འགྱུར། །
en: “ ‘May I never again be led astray by desire, The basest, the most ignoble, and the worst of states.

source: བག་མེད་ཐམས་ཅད་ཡོངས་སུ་སྤངས་གྱུར་ནས། །
en: Having abandoned all forms of inattentiveness,

source: བདག་ནི་རྟག་ཏུ་བག་ཡོད་གྱུར་པར་ཤོག །
en: May I always be able to remain attentive.

source: མི་ཁོམ་བརྒྱད་ལམ་ནམ་ཡང་སྐྱེ་མ་འགྱུར། ། རྟག་ཏུ་དང་བའི་རིགས་སུ་སྐྱེས་གྱུར་ཅིང་། །སྐྱེས་པར་གྱུར་ནས་མི་མཆོག་རྣམས་མཐོང་ལ། །མཐོང་ནས་དེ་ལ་བདག་ནི་དད་པར་ཤོག །
en: “ ‘May I never be born in any of the states of bondage But always into families of faith: After my birth, may I encounter the supreme among men And develop faith in their presence.

source: འདི་འདྲའི་ཡེ་ཤེས་དེ་ནི་བཙལ་བའི་ཕྱིར། །དང་བའི་སེམས་ཀྱིས་མེ་ཏོག་ཕྲེང་བ་དང་། །བྱུག་པ་དག་དང་རྫ་རྔ་རྔ་ཆེན་དང་། །རྔ་དང་གླིང་བུ་དག་གིས་རི་མོར་བགྱི། །
en: “ ‘With a mind filled with devotion, I will honor them With garlands of flowers and with ointments, With drums of wood and clay, and with flutes, With their knowledge as my goal.

source: བསྐལ་པ་བྱེ་མང་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །མཆོད་པ་ཆེན་པོ་དག་ནི་བགྱིས་གྱུར་ནས། །མྱུར་དུ་འདོད་པ་སྤངས་ཏེ་རབ་བྱུང་ལ། །ཚངས་པར་སྤྱད་པ་བདག་ནི་སྤྱོད་པར་ཤོག །
en: “ ‘When I have worshiped them In all these many different ways for many millions of eons, I will lay aside desire and become a renunciant without hesitation. May I always live the life of purity.’
